20251025T151444--kdoc-479-『ネットワークのしくみ』__book.org
:properties:
:ID: 20251025T151444
:end:
#+title:      KDOC 479: 『ネットワークのしくみ』
#+date:       [2025-10-25 Sat 15:14]
#+filetags:   :book:
#+identifier: 20251025T151444

* この文書のステータス
- 作成
  - [X] 2025-11-04 貴島
- レビュー
  - [X] 2025-11-04 貴島

* 概要

『ネットワークのしくみ』はプロトコルを萌え擬人化して解説する本。

* メモ

- Macアドレスには場所にまつわる情報がない。宛先がわからないとブロードキャストするしかない。この動作原理なので、大きなネットワークにはなりようがない。イーサネットはルータは超えられない(p121)
- ルーティングテーブルはネットワークの地図のようなもの。それを見れば次のどのルーターに転送すればいいか目的地に近づくかわかる（p130）
- 最初はTTLを１にしてパケットを送る。するとすぐに消滅するが、中継してくれたパケットがわかる。破棄したルータが教えてくれるから。つぎはTTLを２にすると同様に２番めのルータがわかる。繰り返すと、目的地までに経由するルータのリストが得られるtracert(p133)
- デフォルトゲートウェイ: 宛先が異なるネットワークのとき送信する先。送信先IPアドレスは最終目的地のまま、宛先MACアドレスをデフォルトゲートウェイに送る
- 無線LANといっても、メーカーが違うとつながらない時代があった。その解決のためにWifi-Alliance という団体が作られた。もともとはちゃん無線LAN機器がつながるかを認証する団体だった(p186)

感想。

- 過剰な下ネタや、いかにも萌えっぽい掛け合いでどうかしている雰囲気である。ちゃんとした出版社がついているのに驚く
- しばらく読んでノリに慣れると、プロトコルの擬人化が定着してきて、非常に身近な存在に感じられるようになった

* 関連
なし。
