20251025T151444--kdoc-479-『ネットワークのしくみ』__book.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-11-20T22:05:17Z -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 479: 『ネットワークのしくみ』</title>
<meta name="author" content="kijimaD" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='https://kijimad.github.io/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/site.css' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/code.css' /><link rel='preconnect' href='https://fonts.googleapis.com'><link rel='preconnect' href='https://fonts.gstatic.com' crossorigin><link href='https://fonts.googleapis.com/css2?family=IBM+Plex+Sans+JP&display=swap' rel='stylesheet'>
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 479: 『ネットワークのしくみ』</h1>
<div id="outline-container-orgd9967fc" class="outline-2">
<h2 id="orgd9967fc"><a href="#orgd9967fc">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-orgd9967fc">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2025-11-04 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2025-11-04 貴島</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org4649616" class="outline-2">
<h2 id="org4649616"><a href="#org4649616">概要</a></h2>
<div class="outline-text-2" id="text-org4649616">
<p>
『ネットワークのしくみ』はプロトコルを萌え擬人化して解説する本。
</p>
</div>
</div>
<div id="outline-container-orgc3a154a" class="outline-2">
<h2 id="orgc3a154a"><a href="#orgc3a154a">メモ</a></h2>
<div class="outline-text-2" id="text-orgc3a154a">
<ul class="org-ul">
<li>Macアドレスには場所にまつわる情報がない。宛先がわからないとブロードキャストするしかない。この動作原理なので、大きなネットワークにはなりようがない。イーサネットはルータは超えられない(p121)</li>
<li>ルーティングテーブルはネットワークの地図のようなもの。それを見れば次のどのルーターに転送すればいいか目的地に近づくかわかる（p130）</li>
<li>最初はTTLを１にしてパケットを送る。するとすぐに消滅するが、中継してくれたパケットがわかる。破棄したルータが教えてくれるから。つぎはTTLを２にすると同様に２番めのルータがわかる。繰り返すと、目的地までに経由するルータのリストが得られるtracert(p133)</li>
<li>デフォルトゲートウェイ: 宛先が異なるネットワークのとき送信する先。送信先IPアドレスは最終目的地のまま、宛先MACアドレスをデフォルトゲートウェイに送る</li>
<li>無線LANといっても、メーカーが違うとつながらない時代があった。その解決のためにWifi-Alliance という団体が作られた。もともとはちゃん無線LAN機器がつながるかを認証する団体だった(p186)</li>
</ul>

<p>
感想。
</p>

<ul class="org-ul">
<li>過剰な下ネタや、いかにも萌えっぽい掛け合いでどうかしている雰囲気である。ちゃんとした出版社がついているのに驚く</li>
<li>しばらく読んでノリに慣れると、プロトコルの擬人化が定着してきて、非常に身近な存在に感じられるようになった</li>
</ul>
</div>
</div>
<div id="outline-container-org34fbf17" class="outline-2">
<h2 id="org34fbf17"><a href="#org34fbf17">関連</a></h2>
<div class="outline-text-2" id="text-org34fbf17">
<p>
なし。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer>
</div>
</body>
</html>
